RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
                            ptrIntrCxt->currentSlotIndex = (uint16_t)startSlotId;
                            ptrIntrCxt->endSlotIndex = (uint16_t)lastSlot;
                            /* Initiates the frame start for each channel in interrupt driven scan mode */
                            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                            {
                                ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->FRAME_CMD =
                                    MSC_FRAME_CMD_START_FRAME_Msk;
                            }
                        #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

                        /* Set the single or multiple slot scan mode */
                        if ((1u == numberSlots) &&
                            (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_CALIBRATION_MASK)))
                        {
                            ptrIntrCxt->scanSingleSlot = CY_CAPSENSE_SCAN_SNGL_SLOT;
                        }
                        else
                        {
                            ptrIntrCxt->scanSingleSlot = CY_CAPSENSE_SCAN_MULTIPLE_SLOT;
                        }

                        /* Initialize all enabled MSC channels for scan */
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                            Cy_CapSense_SetBusyFlags(curChIndex, context);

                            #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                                curSlotIndex = startSlotId + ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT);
                                slotValue = context->ptrScanSlots[curSlotIndex].wdId;
                                scanSlotIndexValid = curSlotIndex;
                                if(CY_CAPSENSE_SLOT_EMPTY == slotValue)
                                {
                                    #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
                                        if(curSlotIndex < CY_CAPSENSE_SLOT_COUNT)
                                        {
                                            scanSlotIndexValid += CY_CAPSENSE_SLOT_COUNT;
                                        }
                                        else
                                        {
                                            scanSlotIndexValid -= CY_CAPSENSE_SLOT_COUNT;
                                        }
                                    #endif
                                }
                                else if (CY_CAPSENSE_SLOT_SHIELD_ONLY <= slotValue)
                                {
                                    scanSlotIndexValid = ((uint32_t)context->ptrScanSlots[curSlotIndex].snsId *
                                                          CY_CAPSENSE_SLOT_COUNT) + startSlotId;
                                }
                                else
                                {
                                    /* Do nothing */
                                }
                                /* Initializes for each channel the active sensor structure for the current sensor */
                                wdIndex = context->ptrScanSlots[scanSlotIndexValid].wdId;
                                snsIndex = context->ptrScanSlots[scanSlotIndexValid].snsId;
                                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                                    (void)Cy_CapSense_ConfigureAnalogMuxResource(curChIndex,
                                                context->ptrWdConfig[wdIndex].senseMethod, context);
                                #endif
                                Cy_CapSense_InitActivePtr(curChIndex, wdIndex, snsIndex, context);
                            #endif /* (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

                            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                                if((slotValue != CY_CAPSENSE_SLOT_EMPTY) &&
                                   (slotValue != CY_CAPSENSE_SLOT_SHIELD_ONLY))
                                {
                                    /* Connect the widget first sensor electrodes */
                                    Cy_CapSense_ConnectSensor(curChIndex, context);
                                }
                                /* Getting the sensor frame configuration */
                                ptrSensorFrame = &sensorFrame[0u];
                                (void)Cy_CapSense_GenerateSensorConfig(curChIndex, curSlotIndex, ptrSensorFrame, context);
                                /* Configure the last slot */
                                if (1u == numberSlots)
                                {
                                    sensorFrame[CY_CAPSENSE_SNS_CTL_INDEX] |= MSC_SNS_CTL_LAST_Msk;
                                }
                            #else /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */
                                /* Configure the last slot for each channel */
                                context->ptrSensorFrameContext[((lastSlot + 1u +
                                    (curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT) *
                                        CY_MSC_6_SNS_REGS) - 1u] |= MSC_SNS_CTL_LAST_Msk;

                                #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                                    ptrSensorFrame = &context->ptrSensorFrameContext[(startSlotId +
                                            ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT)) *
                                                                                     CY_MSC_6_SNS_REGS];
                                #endif
                            #endif

                            if (NULL != ptrIntrCxt->ptrSSCallback)
                            {
                                #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                                    ptrIntrCxt->ptrSSCallback((cy_stc_active_scan_sns_t *)&context->ptrActiveScanSns[0u]);
                                #else
                                    ptrIntrCxt->ptrSSCallback(NULL);
                                #endif
                            }

                            #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                                Cy_MSC_ConfigureScan(ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase,
                                                     CY_MSC_6_SNS_REGS, ptrSensorFrame);
                            #endif
                        }

                        #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                            /* Initiates the frame start for each channel in DMA driven scan mode */
                            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                            {
                                ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->FRAME_CMD =
                                    MSC_FRAME_CMD_START_FRAME_Msk;
                            }
                        #endif
                    }
                }
            }
        }
    }

