RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllWidgets_V3
****************************************************************************//**
*
* Calibrates CapDACs for all widgets.
*
* The function is the wrapper for the Cy_CapSense_CalibrateAllSlots() function
* to provide the backward compatibility.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
* This function is available in single-channel solution.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration failed if software
*                                         watchdog timeout occurred
*                                         during any calibration scan,
*                                         the scan was not completed, or
*                                         resulted raw counts
*                                         are outside the limits.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateAllWidgets_V3(
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        #if (1u >= CY_CAPSENSE_TOTAL_CH_NUMBER)
            calibStatus = Cy_CapSense_CalibrateAllSlots(context);
        #endif /* (1u >= CY_CAPSENSE_TOTAL_CH_NUMBER) */
    }

    return (calibStatus);
}
#endif


#if ((1u == CY_CAPSENSE_TOTAL_CH_NUMBER) && \
     ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
      (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateWidget_V3
****************************************************************************//**
*
* Executes the CapDAC calibration for all the sensors in the specified widget
* to the default target value.
*
* This function performs exactly the same tasks as
* Cy_CapSense_CalibrateAllWidgets(), but only for a specified widget.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
* This function is available in single-channel solution.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS   - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The calibration is failed due to
*                                  the issues with scanning (either
*                                  watchdog timer, interrupt breaking, etc.).
* - CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL - The calibration is failed
*                                  because of rawcount is out of the
*                                  defined range.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateWidget_V3(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrationStatus = CY_CAPSENSE_STATUS_SUCCESS;
    cy_stc_capsense_widget_config_t const * ptrWdCfg;
    uint32_t curSlotIndex;

    if (NULL != context)
    {
        context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;

        if (widgetId < context->ptrCommonConfig->numWd)
        {
            ptrWdCfg = &context->ptrWdConfig[widgetId];

            switch(ptrWdCfg->senseMethod)
            {
                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) && (0u != CY_CAPSENSE_CSD_CALIBRATION_EN))
                    case CY_CAPSENSE_CSD_GROUP:

                        /* Calibrate RefCDAC with disabled CompCDAC */
                        #if (0u != CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE)
                            context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK;
                            for (curSlotIndex = ptrWdCfg->firstSlotId;
                                 curSlotIndex < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); curSlotIndex++)
                            {
                                calibrationStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex, CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR, context);
                            }
                            calibrationStatus |= Cy_CapSense_NormalizeCdac(widgetId, context);
                            context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK);
                        #endif

                        /* Find CompDivider with fixed Ref CDAC and maximum CompCDAC (for case #8 or #4) */
                        #if (0u != CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE)
                            calibrationStatus |= Cy_CapSense_CalibrateCompDivider(widgetId, context);
                        #endif

                        /* Calibrate CompCDAC with fixed Ref CDAC and fixed CompDivider (case #3 and #7) */
                        #if (0u != CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                            for (curSlotIndex = ptrWdCfg->firstSlotId;
                                 curSlotIndex < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); curSlotIndex++)
                            {
                                /* Calibrate all sensors in slot */
                                calibrationStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex, CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR, context);
                            }
                        #endif

                        break;

                #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

                #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) && (0u != CY_CAPSENSE_CSX_CALIBRATION_EN))
                    case CY_CAPSENSE_CSX_GROUP:

                        /* Calibrate RefCDAC with disabled CompCDAC */
                        #if (0u != CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE)
                            context->ptrCommonContext->status |= CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK;
                            for (curSlotIndex = ptrWdCfg->firstSlotId;
                                 curSlotIndex < ((uint32_t)ptrWdCfg->firstSlotId + ptrWdCfg->numSlots); curSlotIndex++)
                            {
                                calibrationStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex, CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR, context);
                            }
                            calibrationStatus |= Cy_CapSense_NormalizeCdac(widgetId, context);
                            context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK);
                        #endif

