RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    context->ptrActiveScanSns[chIndex].connectedSnsState = CY_CAPSENSE_SNS_CONNECTED;
}


/*******************************************************************************
* Function Name: Cy_CapSense_DisconnectSensor
****************************************************************************//**
*
* Disconnects a sensor from the specified channel MSC HW block.
*
* The function checks the widget type and performs disconnection of all sensor
* electrodes (sns for CSD widgets and Tx/Rx for CSX ones) including ganged.
* The sensor and the current slot are specified in the cy_stc_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_DisconnectSensor(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context)
{
    uint32_t snsMethod = context->ptrActiveScanSns[chIndex].currentSenseMethod;

    /* Disconnect all current sensor's electrodes */
    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if (CY_CAPSENSE_CSD_GROUP == snsMethod)
        {
            /* Disconnect all pins of the current sensor */
            Cy_CapSense_CsdDisconnectSns(chIndex, context);
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        if (CY_CAPSENSE_CSX_GROUP == snsMethod)
        {
            /* Disconnect current sensor's Tx and Rx IOs for scan
            * and set flag to indicate that IOs should be disconnected */
            Cy_CapSense_CsxDisconnectTx(chIndex, context);
            Cy_CapSense_CsxDisconnectRx(chIndex, context);
        }
    #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

    context->ptrActiveScanSns[chIndex].connectedSnsState = CY_CAPSENSE_SNS_DISCONNECTED;
}


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CsdConnectSns
****************************************************************************//**
*
* Connects a CSD sensor to the specified channel MSC HW block.
*
* The function connects all the sensor pins including ganged.
* The sensor and the current slot are specified in the cy_stc_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsdConnectSns(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_electrode_config_t * eltdPinCfg =
                          context->ptrActiveScanSns[chIndex].ptrEltdConfig;
    const cy_stc_capsense_pin_config_t * ptrActivePin = eltdPinCfg->ptrPin;
    uint32_t i;

    if((chIndex + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
    {
        /* Connect all pins of current sensors */
        for(i = 0u; i < eltdPinCfg->numPins; i++)
        {
            Cy_CapSense_SsConfigPinRegisters(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber,
                    CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_CSD_SENSE);
            ptrActivePin++;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CsdDisconnectSns
****************************************************************************//**
*
* Disconnects a CSD sensor from the specified channel MSC HW block.
*
* The function disconnects all the sensor pins including ganged.
* The sensor and the current slot are specified in the cy_stc_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsdDisconnectSns(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    const cy_stc_capsense_electrode_config_t * eltdPinCfg =
                          context->ptrActiveScanSns[chIndex].ptrEltdConfig;
    const cy_stc_capsense_pin_config_t * ptrActivePin = eltdPinCfg->ptrPin;

    uint32_t i;

    if ((chIndex + context->ptrCommonConfig->channelOffset) == eltdPinCfg->chId)
    {
        /* Disconnect all pins of the current sensor */
        for(i = 0u; i < eltdPinCfg->numPins; i++)
        {
            Cy_CapSense_SsConfigPinRegisters(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber,
                                             context->ptrInternalContext->csdInactiveSnsDm,
                                             context->ptrInternalContext->csdInactiveSnsHsiom);
            Cy_GPIO_Clr(ptrActivePin->pcPtr, (uint32_t)ptrActivePin->pinNumber);
            ptrActivePin++;
        }
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */


#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
/*******************************************************************************
* Function Name: Cy_CapSense_CsxConnectTx
****************************************************************************//**
*
* Connects a CSX sensor Tx electrode to the specified channel MSC HW block.
*
* The function connects all the Tx electrode pins including ganged.
* The electrode and the current slot are specified in the cy_stc_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsxConnectTx(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    uint32_t pinIndex;
    en_hsiom_sel_t hsiomState = CY_CAPSENSE_HSIOM_SEL_CSD_SENSE;
    const cy_stc_capsense_electrode_config_t * ptrEltd;
    const cy_stc_active_scan_sns_t * ptrActive = &context->ptrActiveScanSns[chIndex];
    const cy_stc_capsense_pin_config_t * pinPointer;

