RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_ENABLED)
        uint32_t i;
        uint32_t pattern;
        uint32_t eltdMptxOrder;
        cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[ptrActive->widgetIndex];
        uint32_t mptxOrd = ptrWdCfg->mptxOrder;
    #endif

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_ENABLED)
        if (CY_CAPSENSE_MPTX_MIN_ORDER > mptxOrd)
        {
            ptrEltd = ptrActive->ptrTxConfig;
            if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
            {
                pinPointer = ptrActive->ptrTxConfig->ptrPin;
                for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
                {
                    Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                            CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, hsiomState);
                    pinPointer++;
                }
            }
        }
        else
        {
            /* Finds the index of the first TX electrode in the mptx group */
            eltdMptxOrder = ptrActive->sensorIndex % mptxOrd;
            i = ptrActive->sensorIndex - eltdMptxOrder;
            i = ptrWdCfg->numCols + (i % ptrWdCfg->numRows);
            ptrEltd = &ptrWdCfg->ptrEltdConfig[i];

            /* Finding the right vector / pattern for mptx operation */
            pattern = ptrWdCfg->ptrMptxTable->vector;
            if (0u != eltdMptxOrder)
            {
                pattern = (pattern >> eltdMptxOrder) | (pattern << (mptxOrd - eltdMptxOrder));
            }

            if (CY_CAPSENSE_MPTX_MAX_ORDER > mptxOrd)
            {
                pattern &= (0x01uL << mptxOrd) - 1u;
            }

            /* Loop through all involved mptx TX electrodes, positive and negative */
            for (i = 0u; i < mptxOrd; i++)
            {
                if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
                {
                    hsiomState = CY_CAPSENSE_HSIOM_SEL_CSD_SENSE;
                    if (0u == (pattern & 0x01u))
                    {
                        hsiomState = CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD;
                    }
                    pinPointer = ptrEltd->ptrPin;
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
                    {
                        Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                                CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, hsiomState);
                        pinPointer++;
                    }
                }
                pattern >>= 0x01u;
                ptrEltd++;
            }
        }
    #else
        ptrEltd = ptrActive->ptrTxConfig;
        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
        {
            pinPointer = ptrActive->ptrTxConfig->ptrPin;
            for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
            {
                Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                        CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF, hsiomState);
                pinPointer++;
            }
        }
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_CsxConnectRx
****************************************************************************//**
*
* Connects a CSX sensor Rx electrode to the specified channel MSC HW block.
*
* The function connects all the Rx electrode pins including ganged.
* The electrode and the current slot are specified in the cy_stc_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsxConnectRx(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    uint32_t pinIndex;
    const cy_stc_capsense_pin_config_t * pinPointer =
                context->ptrActiveScanSns[chIndex].ptrRxConfig->ptrPin;

    if ((chIndex + context->ptrCommonConfig->channelOffset) == context->ptrActiveScanSns[chIndex].ptrRxConfig->chId)
    {
        for (pinIndex = context->ptrActiveScanSns[chIndex].ptrRxConfig->numPins;
             pinIndex-- > 0u;)
        {
            Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                    CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
            pinPointer++;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_CsxDisconnectTx
****************************************************************************//**
*
* Disconnects a CSX sensor Tx electrode from the specified channel MSC HW block.
*
* The function disconnects all the Tx electrode pins including ganged.
* The electrode and the current slot are specified in the cy_stc_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsxDisconnectTx(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    uint32_t pinIndex;
    const cy_stc_capsense_electrode_config_t * ptrEltd;
    const cy_stc_active_scan_sns_t * ptrActive = &context->ptrActiveScanSns[chIndex];
    const cy_stc_capsense_pin_config_t * pinPointer = ptrActive->ptrTxConfig->ptrPin;

    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_ENABLED)
        uint32_t i;
        uint32_t eltdMptxOrder;
        cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[ptrActive->widgetIndex];
        uint32_t mptxOrd = ptrWdCfg->mptxOrder;
    #endif

