RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_MULTI_PHASE_ENABLED)
        if (CY_CAPSENSE_MPTX_MIN_ORDER > mptxOrd)
        {
            ptrEltd = ptrActive->ptrTxConfig;
            if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
            {
                for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
                {
                    Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                                                     context->ptrInternalContext->csxInactiveSnsDm,
                                                     context->ptrInternalContext->csxInactiveSnsHsiom);
                    Cy_GPIO_Clr(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber);
                    pinPointer++;
                }
            }
        }
        else
        {
            /* Finds the index of the first TX electrode in the mptx group */
            eltdMptxOrder = ptrActive->sensorIndex % mptxOrd;
            i = ptrActive->sensorIndex - eltdMptxOrder;
            i = ptrWdCfg->numCols + (i % ptrWdCfg->numRows);
            ptrEltd = &ptrWdCfg->ptrEltdConfig[i];

            /* Loop through all involved mptx TX electrodes, positive and negative */
            for (i = 0u; i < mptxOrd; i++)
            {
                if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
                {
                    pinPointer = ptrEltd->ptrPin;
                    /* Loop through all pads for this electrode (ganged sensor) */
                    for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
                    {
                        Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                                                         context->ptrInternalContext->csxInactiveSnsDm,
                                                         context->ptrInternalContext->csxInactiveSnsHsiom);
                        Cy_GPIO_Clr(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber);
                        pinPointer++;
                    }
                }
                ptrEltd++;
            }
        }
    #else
        ptrEltd = ptrActive->ptrTxConfig;
        if ((chIndex + context->ptrCommonConfig->channelOffset) == ptrEltd->chId)
        {
            for (pinIndex = ptrEltd->numPins; pinIndex-- > 0u;)
            {
                Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                                                 context->ptrInternalContext->csxInactiveSnsDm,
                                                 context->ptrInternalContext->csxInactiveSnsHsiom);
                Cy_GPIO_Clr(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber);
                pinPointer++;
            }
        }
    #endif
}


/*******************************************************************************
* Function Name: Cy_CapSense_CsxDisconnectRx
****************************************************************************//**
*
* Disconnects a CSX sensor Rx electrode from the specified channel MSC HW block.
*
* The function disconnects all the Rx electrode pins including ganged.
* The electrode and the current slot are specified in the cy_stc_active_scan_sns_t structure.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_CsxDisconnectRx(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    uint32_t pinIndex;
    const cy_stc_capsense_pin_config_t * pinPointer =
                context->ptrActiveScanSns[chIndex].ptrRxConfig->ptrPin;

    if ((chIndex + context->ptrCommonConfig->channelOffset) == context->ptrActiveScanSns[chIndex].ptrRxConfig->chId)
    {
        for (pinIndex = context->ptrActiveScanSns[chIndex].ptrRxConfig->numPins;
             pinIndex-- > 0u;)
        {
            Cy_CapSense_SsConfigPinRegisters(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber,
                                             context->ptrInternalContext->csxInactiveSnsDm,
                                             context->ptrInternalContext->csxInactiveSnsHsiom);
            Cy_GPIO_Clr(pinPointer->pcPtr, (uint32_t)pinPointer->pinNumber);
            pinPointer++;
        }
    }
}
#endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */


/*******************************************************************************
* Function Name: Cy_CapSense_ScanISR
****************************************************************************//**
*
* This is an internal ISR function to handle the MSC sensing method operation.
*
* \param capsenseContext
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ScanISR(void * capsenseContext)
{
    uint32_t intrMask;
    uint32_t i;
    MSC_Type * ptrMscHwBase;

    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        uint32_t tmpRawCount;
        uint32_t slotValue;
        uint32_t wdIndex;

        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
            uint32_t prevWdIndex;
        #else
            uint32_t * ptrSensorFrame;
        #endif
    #endif

    cy_stc_capsense_context_t * cxt = (cy_stc_capsense_context_t *)capsenseContext;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = cxt->ptrCommonConfig;

    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        uint32_t scanSlotIndexValid;
        cy_stc_active_scan_sns_t * ptrActive;
        cy_stc_capsense_internal_context_t * ptrIntrCxt = cxt->ptrInternalContext;
        uint32_t slotStcIndex;
    #endif /* (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) */
    uint32_t curChIndex = (uint32_t)ptrCommonCfg->channelOffset + CY_CAPSENSE_TOTAL_CH_NUMBER;

    /* Define the interrupt scope */
    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        intrMask = MSC_INTR_MASK_FRAME_Msk;
    #else
        intrMask = MSC_INTR_MASK_SCAN_Msk;
    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

    /* Check which channel have fired the interrupt */
    for (i = 0u; i < CY_CAPSENSE_TOTAL_CH_NUMBER; i++)
    {
        if (0u != (ptrCommonCfg->ptrMscChConfig[i].ptrMscBase->INTR & intrMask))
        {
            curChIndex = i;
            break;
        }
    }

    ptrMscHwBase = ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase;

