RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_AmuxUpdateScanConfig
****************************************************************************//**
*
* Updates the MSC HW block with the configuration of the specified scan slot.
*
* \param chIndex
* The desired channel index.
*
* \param scanSlot
* Specifies the ID number of the slot.
*
* \param prevWdIndex
* Specifies the ID number of the widget scanned in scope of previous scan.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_AmuxUpdateScanConfig(
                uint32_t chIndex,
                uint32_t scanSlot,
                uint32_t prevWdIndex,
                cy_stc_capsense_context_t * context)
{
    uint32_t isSnsRow = 0u;
    MSC_Type * ptrMscHwBase = context->ptrCommonConfig->ptrMscChConfig[chIndex].ptrMscBase;
    cy_stc_active_scan_sns_t * ptrActive = &context->ptrActiveScanSns[chIndex];
    uint32_t sensorFrame[CY_MSC_6_SNS_REGS] = {0u, 0u, 0u, 0u, 0u, 0u};

    #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
        if((CY_CAPSENSE_CSD_GROUP == ptrActive->currentSenseMethod) &&
           (context->ptrWdConfig[ptrActive->widgetIndex].numCols <= ptrActive->sensorIndex))
        {
            isSnsRow = 1u;
        }
    #endif

    if((prevWdIndex != ptrActive->widgetIndex) || (0u != isSnsRow))
    {
        (void)Cy_CapSense_GenerateSensorConfig(chIndex, scanSlot, &sensorFrame[0u], context);

        sensorFrame[CY_CAPSENSE_SNS_CTL_INDEX] &= ~MSC_SNS_CTL_START_SCAN_Msk;
        /* Configure the last slot */
        if (context->ptrInternalContext->endSlotIndex == ptrActive->currentChannelSlotIndex)
        {
            sensorFrame[CY_CAPSENSE_SNS_CTL_INDEX] |= MSC_SNS_CTL_LAST_Msk;
        }

        /* Start the next scan for the current channel */
        Cy_MSC_ConfigureScan(ptrMscHwBase, CY_MSC_6_SNS_REGS, &sensorFrame[0u]);
    }
    else
    {
        if (CY_CAPSENSE_CSD_GROUP == ptrActive->currentSenseMethod)
        {
            #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                Cy_CapSense_AmuxUpdateCdacComp(ptrMscHwBase, ptrActive->ptrSnsContext);
            #endif
        }
        else
        {
            #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE)
                Cy_CapSense_AmuxUpdateCdacComp(ptrMscHwBase, ptrActive->ptrSnsContext);
            #endif
        }

        /* Configure the last slot */
        if (context->ptrInternalContext->endSlotIndex == ptrActive->currentChannelSlotIndex)
        {
            ptrMscHwBase->SNS_CTL |= MSC_SNS_CTL_LAST_Msk;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_AmuxStartScan
****************************************************************************//**
*
* Starts the scan on the specified MSC HW block.
*
* \param base
* Pointer to a MSC HW block base address.
*
*******************************************************************************/
void Cy_CapSense_AmuxStartScan(MSC_Type * base)
{
    base->SNS_CTL |= MSC_SNS_CTL_START_SCAN_Msk;
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_SetCmodInDefaultState
****************************************************************************//**
*
* Sets all available MSC Cmod pins connected via AMuxBus into a default state .
*
* Sets all external capacitors connected via AMuxBus into the default state:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - High-Z Analog, Input off drive mode.
*
* Do not call this function directly from the application program.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCmodInDefaultState(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(
            context->ptrCommonConfig->ptrMscChConfig[chIndex].portCmod1,
            (uint32_t)context->ptrCommonConfig->ptrMscChConfig[chIndex].pinCmod1,
            CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);
    Cy_CapSense_SsConfigPinRegisters(
            context->ptrCommonConfig->ptrMscChConfig[chIndex].portCmod2,
            (uint32_t)context->ptrCommonConfig->ptrMscChConfig[chIndex].pinCmod2,
            CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);
}


#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
/*******************************************************************************
* Function Name: Cy_CapSense_SetCmodInAmuxModeState
****************************************************************************//**
*
* Sets all available MSC Cmod pins connected via AMuxBus into a default state.
*
* Sets all external capacitors connected via AMuxBus into the default state:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - High-Z Analog.
*
* Do not call this function directly from the application program.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetCmodInAmuxModeState(
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    Cy_CapSense_SsConfigPinRegisters(
            context->ptrCommonConfig->ptrMscChConfig[chIndex].portCmod1,
            (uint32_t)context->ptrCommonConfig->ptrMscChConfig[chIndex].pinCmod1,
            CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);

    Cy_CapSense_SsConfigPinRegisters(
            context->ptrCommonConfig->ptrMscChConfig[chIndex].portCmod2,
            (uint32_t)context->ptrCommonConfig->ptrMscChConfig[chIndex].pinCmod2,
            CY_CAPSENSE_DM_GPIO_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
}
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */


#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
/*******************************************************************************
* Function Name: Cy_CapSense_SetIOsInDesiredState
****************************************************************************//**
*
* Sets all CAPSENSE&trade; pins into a desired state.
*
* Sets all the CSD/CSX IOs into a desired state.
* Default state:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - Strong drive.
* - State   - Zero.
*
* Do not call this function directly from the application program.
*
* \param desiredDriveMode
* Specifies the desired pin control port (PC) configuration.
*
* \param desiredPinOutput
* Specifies the desired pin output data register (DR) state.
*
* \param desiredHsiom
* Specifies the desired pin HSIOM state.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetIOsInDesiredState(
                uint32_t desiredDriveMode,
                uint32_t desiredPinOutput,
                en_hsiom_sel_t desiredHsiom,
                uint32_t chIndex,
                const cy_stc_capsense_context_t * context)
{
    uint32_t loopIndex;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;

