RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_IsBusy_V3
****************************************************************************//**
*
* This function returns a status of the CAPSENSE&trade; middleware whether a scan is
* currently in progress or not.
*
* If the middleware is busy, a new scan or setup widgets should not be initiated.
*
* Use the Cy_CapSense_MwState() function to check a detailed CAPSENSE&trade; middleware
* state.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the middleware:
* - CY_CAPSENSE_NOT_BUSY    - No scan is in progress and a next scan
*                             can be initiated.
* - CY_CAPSENSE_BUSY        - The previously initiated scan is in progress.
*
*******************************************************************************/
uint32_t Cy_CapSense_IsBusy_V3(const cy_stc_capsense_context_t * context)
{
    return (context->ptrCommonContext->status & CY_CAPSENSE_BUSY);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetBusyFlags
****************************************************************************//**
*
* Sets BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application program.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetBusyFlags(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->status |= ((((uint32_t)CY_CAPSENSE_BUSY_CH_MASK) << chIndex) |
                                          CY_CAPSENSE_BUSY);
}


/*******************************************************************************
* Function Name: Cy_CapSense_ClrBusyFlags
****************************************************************************//**
*
* Clears BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application program.
*
* \param chIndex
* The desired channel index.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ClrBusyFlags(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context)
{
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        /* Clear Last flag inside sensor frame structure for the current channel */
        uint32_t snsPos = context->ptrInternalContext->endSlotIndex + (context->ptrCommonConfig->numSlots * chIndex);
        context->ptrSensorFrameContext[snsPos * CY_MSC_6_SNS_REGS + CY_CAPSENSE_SNS_CTL_INDEX] &= ~MSC_SNS_CTL_LAST_Msk;
    #endif

    /* Clear busy flag for the current channel */
    context->ptrCommonContext->status &= (uint32_t)(~(((uint32_t)CY_CAPSENSE_BUSY_CH_MASK) << chIndex));
    if(0u == (context->ptrCommonContext->status & CY_CAPSENSE_BUSY_ALL_CH_MASK))
    {
        context->ptrCommonContext->status &= ~CY_CAPSENSE_BUSY;
    }

    if (0u == context->ptrCommonContext->status)
    {
        /* Mark completion of scan cycle */
        context->ptrCommonContext->scanCounter++;
        /* Check for EndOfScan callback */
        if (NULL != context->ptrInternalContext->ptrEOSCallback)
        {
            #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                context->ptrInternalContext->ptrEOSCallback((cy_stc_active_scan_sns_t *)&context->ptrActiveScanSns[0u]);
            #else
                context->ptrInternalContext->ptrEOSCallback(NULL);
            #endif
        }
    }
}

#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
/*******************************************************************************
* Function Name: Cy_CapSense_ConfigureAnalogMuxResource
****************************************************************************//**
*
* Configures the Analog Mux connections for a specified channel. This function
* should be called before call of the Cy_CapSense_InitActivePtr() function.
*
* \param chIndex
* The desired channel index.
*
* \param snsMethod
* Desired sensing method the Analog Mux resources should be configured to.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ConfigureAnalogMuxResource(
                uint32_t chIndex,
                uint32_t snsMethod,
                cy_stc_capsense_context_t * context)
{
    uint32_t * ptrSwSelCfg;
    uint32_t prevSnsMethod = (uint32_t)context->ptrActiveScanSns[chIndex].currentSenseMethod;

    if(snsMethod != prevSnsMethod)
    {
        ptrSwSelCfg = &context->ptrBaseFrameContext[chIndex].swSelGpio;

        *ptrSwSelCfg &= ~CY_CAPSENSE_CMOD_AMUX_MSK;
        context->ptrCommonConfig->ptrMscChConfig[chIndex].ptrMscBase->SW_SEL_GPIO = *ptrSwSelCfg;

        /* Enable the specified mode */
        if (CY_CAPSENSE_CSD_GROUP == snsMethod)
        {
            *ptrSwSelCfg |= CY_CAPSENSE_FW_CMOD_AMUX_CSD_REG_SW_SEL_GPIO_VALUE;
            Cy_CapSense_SetIOsInDesiredState(context->ptrInternalContext->csdInactiveSnsDm, 0u,
                                             context->ptrInternalContext->csdInactiveSnsHsiom, chIndex, context);
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                Cy_CapSense_EnableShieldElectrodes(chIndex, context);
            #endif
        }
        else
        {
            *ptrSwSelCfg |= CY_CAPSENSE_FW_CMOD_AMUX_CSX_REG_SW_SEL_GPIO_VALUE;
            Cy_CapSense_SetIOsInDesiredState(context->ptrInternalContext->csxInactiveSnsDm, 0u,
                                             context->ptrInternalContext->csxInactiveSnsHsiom, chIndex, context);
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                Cy_CapSense_DisableShieldElectrodes(chIndex, context);
            #endif
        }

        context->ptrCommonConfig->ptrMscChConfig[chIndex].ptrMscBase->SW_SEL_GPIO = *ptrSwSelCfg;
    }
}
#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */


#if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
/*******************************************************************************
* Function Name: Cy_CapSense_InitializeDmaResource
****************************************************************************//**
*
* Initializes the DMAC channels in CS-DMA scanning mode.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of operation.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeDmaResource(
                cy_stc_capsense_context_t * context)
{
    const cy_stc_msc_channel_config_t * ptrCurMscChCfg = context->ptrCommonConfig->ptrMscChConfig;
    uint32_t curChIndex;
    uint8_t wrIdx;
    uint8_t rdIdx;
    uint8_t wrChIdx;
    uint8_t rdChIdx;
    DMAC_Type * dmacBase;
    MSC_Type * mscBase;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context->ptrCommonConfig->ptrDmacBase)
    {
        dmacBase = context->ptrCommonConfig->ptrDmacBase;
        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
        {
            ptrCurMscChCfg = &(context->ptrCommonConfig->ptrMscChConfig[curChIndex]);
            mscBase = ptrCurMscChCfg->ptrMscBase;
            wrIdx = ptrCurMscChCfg->dmaWrChIndex;
            wrChIdx = ptrCurMscChCfg->dmaChainWrChIndex;
            rdIdx = ptrCurMscChCfg->dmaRdChIndex;
            rdChIdx = ptrCurMscChCfg->dmaChainRdChIndex;

