RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        uint32_t * ptrSnsFrmCxt;
        uint32_t * ptrSnsFrmCxtArray[CY_CAPSENSE_MAX_CH_NUM];
    #endif

    /* Checks a slot for auto-calibration */
    for(chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
    {
        wdIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].wdId;
        if (CY_CAPSENSE_SLOT_SHIELD_ONLY > wdIndex)
        {
            /* Finds a sensing method for existing slot */
            sensingGroup = context->ptrWdConfig[wdIndex].senseMethod;
            /* Checks if the auto-calibration is enabled for the current sense method */
            #if(CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)
                if(CY_CAPSENSE_CSX_GROUP == sensingGroup)
                {
                    sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                }
            #else

                #if(CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE)
                    if((CY_CAPSENSE_CSX_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR == autoCalibrMode))
                    {
                        sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                    }
                #endif

                #if(CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE)
                    if((CY_CAPSENSE_CSX_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR == autoCalibrMode))
                    {
                        sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                    }
                #endif
            #endif

            #if(CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSD_CALIBRATION_EN)
                if(CY_CAPSENSE_CSD_GROUP == sensingGroup)
                {
                    sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                }
            #else

                #if(CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE)
                    if((CY_CAPSENSE_CSD_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR == autoCalibrMode))
                    {
                        sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                    }
                #endif

                #if(CY_CAPSENSE_DISABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE)
                    if((CY_CAPSENSE_CSD_GROUP == sensingGroup) && (CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR == autoCalibrMode))
                    {
                        sensingGroup = CY_CAPSENSE_UNDEFINED_GROUP;
                    }
                #endif
            #endif

            /* Different sensing methods not allowed in a single slot */
            break;
        }
    }

    /* Skips non-auto-calibrated slots */
    if (CY_CAPSENSE_UNDEFINED_GROUP != sensingGroup)
    {
        for(chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
        {
            /* Populates all sensors in widget */
            wdIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].wdId;
            if(CY_CAPSENSE_SLOT_SHIELD_ONLY > wdIndex)
            {
                calibrationBitEn |= (uint32_t)(0x01uL << chIndex);

                snsIndex = context->ptrScanSlots[scanSlotId + (CY_CAPSENSE_SLOT_COUNT * chIndex)].snsId;
                ptrWdCfg = &context->ptrWdConfig[wdIndex];

                /* Gets target in percentage */
                target = context->ptrInternalContext->intrCsdRawTarget;

                #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    if(CY_CAPSENSE_CSX_GROUP == sensingGroup)
                    {
                        target = context->ptrInternalContext->intrCsxRawTarget;
                    }
                #endif

                snsClkTmp = context->ptrWdContext[wdIndex].snsClk;

                #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                    if ((CY_CAPSENSE_CSD_GROUP == sensingGroup) && (ptrWdCfg->numCols <= snsIndex))
                    {
                        snsClkTmp = context->ptrWdContext[wdIndex].rowSnsClk;
                    }
                #endif

                maxRawTmp = Cy_CapSense_GetMaxRaw(snsClkTmp, ptrWdCfg, context);
                rawTarget[chIndex] = (uint16_t)((maxRawTmp * target) / CY_CAPSENSE_PERCENTAGE_100);
                ptrSnsCxtArray[chIndex] = &ptrWdCfg->ptrSnsContext[snsIndex];
                ptrSnsCxtArray[chIndex]->cdacComp = 0u;

                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                    ptrSnsFrmCxtArray[chIndex] = &context->ptrSensorFrameContext[CY_MSC_6_SNS_REGS *
                                                (context->ptrCommonConfig->numSlots * chIndex + scanSlotId) + CY_CAPSENSE_SNS_CDAC_CTL_INDEX];
                #endif
            }
        }

        /* Perform repeated continuous scan of a slot and tune CDAC */
        do
        {
            ptrRawTarget = &rawTarget[0u];
            for(chIndex = 0u; chIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; chIndex++)
            {
                if(0u != (calibrationBitEn & (0x01uL << chIndex)))
                {
                    ptrSnsCxt = ptrSnsCxtArray[chIndex];

                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
                        ptrSnsFrmCxt = ptrSnsFrmCxtArray[chIndex];
                    #endif
                    /* Update CDACs based on scan result */
                    ptrCdac = &ptrSnsCxt->cdacComp;
                    if(CY_CAPSENSE_CSD_GROUP == sensingGroup)
                    {
                        if ((uint32_t)ptrSnsCxt->raw < *ptrRawTarget)
                        {
                            *ptrCdac &= ~(uint8_t)calMaskPast;
                        }
                    }
                    else
                    {
                        if ((uint32_t)ptrSnsCxt->raw >= *ptrRawTarget)
                        {
                            *ptrCdac &= ~(uint8_t)calMaskPast;
                        }
                    }
                    *ptrCdac |= (uint8_t)calMaskNext;
                    if(0u == *ptrCdac)
                    {
                        (*ptrCdac)++;
                    }

