RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    for (i = 0u; i < ptrEltdCfg->numPins; i++)
    {
        mask |= 0x01uL << ptrEltdCfg->ptrPin->padNumber;
    }

    for (i = 0u; i < CY_CAPSENSE_CTRLMUX_PIN_STATE_MASK_NUMBER; i++)
    {
        ptrSnsFrm[i] &= ~mask;
        if (0u != (pinState & (1u << (CY_CAPSENSE_CTRLMUX_PIN_STATE_MASK_NUMBER - 1u - i))))
        {
            ptrSnsFrm[i] |= mask;
        }
    }

    return (capStatus);
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_SwitchHwConfiguration
****************************************************************************//**
*
* Configures CAPSENSE&trade;-related hardware to the specified state.
*
* \param configuration
* The state of CAPSENSE&trade;-related hardware:
* * CY_CAPSENSE_HW_CONFIG_UNDEFINED.
* * CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT.
* * CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS      - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM    - At least one of input parameters is not valid.
* - CY_CAPSENSE_STATUS_HW_BUSY      - The MSC HW block is busy and cannot be
*                                     configured.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SwitchHwConfiguration(
                uint32_t configuration,
                cy_stc_capsense_context_t * context)
{
    uint32_t curChIndex;
    cy_en_msc_status_t mscStatus;
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;

    if (context->ptrInternalContext->hwConfigState != configuration)
    {
        /* Turn off the previous HW configuration */
        switch (context->ptrInternalContext->hwConfigState)
        {
            case CY_CAPSENSE_HW_CONFIG_UNDEFINED:
                break;
            case CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT:
                break;
            case CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING:
                break;
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN)
                case CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY:
                    Cy_CapSense_BistDisableMode(context);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_HW_GROUP_EN) */
            default:
                capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                break;
        }
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            /* Turn on the desired HW configuration */
            switch (configuration)
            {
                case CY_CAPSENSE_HW_CONFIG_UNDEFINED:
                    break;
                case CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT:
                    break;
                case CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING:
                    Cy_CapSense_SetModClkDivider(context->ptrCommonContext->modClk, context);
                    Cy_CapSense_SetIOsInDefaultState(context);
                    #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
                        Cy_CapSense_SetShieldPinsInDefaultState(context);
                    #endif

                    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                        (void)Cy_CapSense_InitializeDmaResource(context);
                        /* Set undefined value to initiate DMA configuration in Cy_CapSense_ScanSlots() function */
                        context->ptrInternalContext->currentSlotIndex = CY_CAPSENSE_SLOT_COUNT_MAX_VALUE;
                    #endif /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

                    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                    {
                        context->ptrActiveScanSns[curChIndex].currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;

                        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                            Cy_CapSense_SetCmodInAmuxModeState(curChIndex, context);
                        #else
                            Cy_CapSense_SetCmodInDefaultState(curChIndex, context);
                        #endif

                        /* MSCv3 IP Block Base Register Configuration */
                        mscStatus = Cy_MSC_Configure(ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase,
                                                    &context->ptrBaseFrameContext[curChIndex],
                                                    CY_MSC_CAPSENSE_KEY,
                                                    ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscContext);
                        if (CY_MSC_SUCCESS != mscStatus)
                        {
                            capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
                            break;
                        }

                        /* Clear all pending interrupts of the MSC HW block */
                        ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
                        (void)ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->INTR;
                    }
                    break;
                case CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY:
                    Cy_CapSense_SetIOsInDefaultState(context);
                    Cy_CapSense_SetShieldPinsInDefaultState(context);

                    for (curChIndex = 0u; curChIndex < context->ptrCommonConfig->numChannels; curChIndex++)
                    {
                        context->ptrActiveScanSns[curChIndex].currentSenseMethod = CY_CAPSENSE_UNDEFINED_GROUP;
                        Cy_CapSense_SetCmodInDefaultState(curChIndex, context);
                        /* Clear all pending interrupts of the MSC HW block */
                        ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
                        (void)ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->INTR;
                    }
                    break;
                default:
                    capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
                    break;
            }
        }
        if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
        {
            context->ptrInternalContext->hwConfigState = (uint8_t)configuration;
        }
    }

