RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
/*******************************************************************************
* Function Name: Cy_CapSense_GetLfsrBitsAuto
****************************************************************************//**
*
* Selects the number of LSB bits to use from the LSFR to provide the clock
* dithering variation on the base period if the snsClkSource member of the
* cy_stc_capsense_widget_context_t is configured with the
* CY_CAPSENSE_CLK_SOURCE_SSC_AUTO_MASK mask or with the or the
* CY_CAPSENSE_CLK_SOURCE_SSC value.
*
* \param ptrWdConfig
* Specifies the pointer to a widget configuration structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLfsrBitsAuto(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                const cy_stc_capsense_context_t * context)
{
    uint32_t lfsrScale;
    uint32_t lfsrRange;
    uint32_t ditherLimitPercents;
    uint32_t snsClkDividerMin;
    uint32_t snsClkDividerTmp;

    const cy_stc_capsense_widget_context_t * ptrWdCxt;

    ptrWdCxt = ptrWdConfig->ptrWdContext;
    snsClkDividerTmp = ptrWdCxt->snsClk;
    lfsrScale = context->ptrCommonContext->lfsrScale;
    ditherLimitPercents = ptrWdConfig->lfsrDitherLimit;

    #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
        (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if((CY_CAPSENSE_CSD_GROUP == ptrWdConfig->senseMethod) &&
           (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdConfig->wdType) ||
            ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdConfig->wdType)))
        {
            /*
            * Obtain the MIN Sense Clock divider within the two-dimension CSD widget.
            * The LFSR range should be determined, basing on the MIN Sense Clock
            * divider in order to be sufficient for rows and columns.
            */
            if(snsClkDividerTmp > ptrWdCxt->rowSnsClk)
            {
                snsClkDividerTmp = ptrWdCxt->rowSnsClk;
            }
        }
    #endif

    /* Determine the MIN valid Sense Clock divider for the used sensing method. */
    if(CY_CAPSENSE_CSD_GROUP == ptrWdConfig->senseMethod)
    {
        snsClkDividerMin = CY_CAPSENSE_4PH_DIRECT_SNS_CLOCK_DIVIDER_MIN;
    }
    else
    {
        snsClkDividerMin = CY_CAPSENSE_2PH_DIRECT_SNS_CLOCK_DIVIDER_MIN;
    }

    /*
    * Execute the LFSR range selection routine. This routine determines
    * the LFSR_BITS option, required to provide the max clock dithering variation
    * for the specified sense Clock divider, LFSR dither (in percents) and
    * LFSR scale values.
    */
    lfsrRange = Cy_CapSense_GetLfsrBitsNumber(snsClkDividerTmp, snsClkDividerMin,
                                              ditherLimitPercents, lfsrScale);

    return (lfsrRange | CY_CAPSENSE_LFSR_BITS_AUTO_MASK);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetClkSrcSSCAuto
****************************************************************************//**
*
* Performs checking if the SSC clock source is valid for the widget, specified
* by the input parameter.
*
* \param ptrWdConfig
* Specifies the pointer to a widget configuration structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the valid clock source:
* - SSC    -if SSC is valid for the specified widget configuration.
* - Direct -if SSC is not valid for the specified widget configuration.
* The CY_CAPSENSE_CLK_SOURCE_SSC_AUTO_MASK bit is always set in the return
* value.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetClkSrcSSCAuto(
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                const cy_stc_capsense_context_t * context)
{
    uint32_t lfsrRange;
    uint32_t lfsrScale;
    uint32_t snsClkSrc;
    uint32_t autoSelMode;
    uint32_t ditherLimitPercents;
    uint32_t lfsrDitherCycles;
    uint32_t ditherLimitCycles;
    uint32_t lfsrPolySize;
    uint32_t snsClkDivMin;
    uint32_t subConvNumber;
    const cy_stc_capsense_widget_context_t * ptrWdCxt;
    #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
        (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        uint32_t snsClkSrcRow;
    #endif

    ptrWdCxt = ptrWdConfig->ptrWdContext;

    /*
    * Determine the whole number of sub-conversion per scan (includes Dummy and
    * Measurement conversions).
    */
    subConvNumber = ptrWdCxt->numSubConversions;
    subConvNumber += context->ptrCommonContext->numFineInitCycles;
    if (CY_CAPSENSE_16_BIT_MASK < subConvNumber)
    {
        subConvNumber = CY_CAPSENSE_16_BIT_MASK;
    }
    lfsrRange = ((uint32_t)ptrWdCxt->lfsrBits & (uint32_t)(~((uint32_t)CY_CAPSENSE_LFSR_BITS_AUTO_MASK)));
    lfsrScale = context->ptrCommonContext->lfsrScale;
    autoSelMode = ptrWdConfig->snsClkSourceAutoSelMode;
    ditherLimitPercents = ptrWdConfig->lfsrDitherLimit;

    /*
    * Determine the polynomial duration in clock cycles, e.g. the duration of 8-bit
    * polynomial is 255 clock cycles.
    */
    lfsrPolySize = Cy_CapSense_GetPolySize(context->ptrCommonContext->lfsrPoly);

    /*
    * Determine the clock dithering variation for the specifies LFSR range,
    * e.g for the [-2; 1] range the clock variation will be 2 cycles.
    */
    lfsrDitherCycles = Cy_CapSense_GetLfsrDitherVal(lfsrRange, lfsrScale);

    /* Determine the MIN valid Sense Clock divider for the used sensing method. */
    if(CY_CAPSENSE_CSD_GROUP == ptrWdConfig->senseMethod)
    {
        snsClkDivMin = CY_CAPSENSE_4PH_DIRECT_SNS_CLOCK_DIVIDER_MIN;
    }
    else
    {
        snsClkDivMin = CY_CAPSENSE_2PH_DIRECT_SNS_CLOCK_DIVIDER_MIN;
    }

    /*
    * Determines the max allowed clock dithering variation for the specified
    * Sense Clock divider, LFSR dither (in percents) and LFSR scale values.
    */
    ditherLimitCycles = Cy_CapSense_GetLfsrDitherLimit(ptrWdCxt->snsClk,
                                    snsClkDivMin, ditherLimitPercents, lfsrScale);

