RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    /*
    * Execute the SSC-Auto selection routine. This routine validates all the
    * criteria, that are required for good SSC performance are met.
    * The CY_CAPSENSE_CLK_SOURCE_SSC will be returned if all the criteria are met,
    * the CY_CAPSENSE_CLK_SOURCE_DIRECT will be returned if not.
    */
    snsClkSrc = Cy_CapSense_RunSSCAuto(autoSelMode, lfsrDitherCycles,
                                    ditherLimitCycles, lfsrPolySize, subConvNumber);

    #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
        (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        /* Repeat the SSC-Auto selection routine for the row of two-dimension CSD
         * widget.
         */
        if((CY_CAPSENSE_CSD_GROUP == ptrWdConfig->senseMethod) &&
           (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdConfig->wdType) ||
            ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdConfig->wdType)))
        {
            if((uint8_t)CY_CAPSENSE_CLK_SOURCE_DIRECT != snsClkSrc)
            {
                ditherLimitCycles = Cy_CapSense_GetLfsrDitherLimit(ptrWdCxt->rowSnsClk,
                                                snsClkDivMin, ditherLimitPercents, lfsrScale);
                snsClkSrcRow = Cy_CapSense_RunSSCAuto(autoSelMode, lfsrDitherCycles,
                                                ditherLimitCycles, lfsrPolySize, (uint16_t)subConvNumber);

                if(snsClkSrc != snsClkSrcRow)
                {
                    /*
                    * If the automatically determined Sense Clock sources for
                    * rows and columns are different, the widget Sense Clock
                    * source should be set to Direct.
                    */
                    snsClkSrc = CY_CAPSENSE_CLK_SOURCE_DIRECT;
                }
            }
        }
    #endif

    return (snsClkSrc | CY_CAPSENSE_CLK_SOURCE_SSC_AUTO_MASK);
}


/*******************************************************************************
* Function Name: Cy_CapSense_RunSSCAuto
****************************************************************************//**
*
* Implements checking the following rules:
* 1. An LFSR value should be selected so that the max clock dither in percents
*    is limited with the value, specified by the lfsrDitherLimit parameter.
* 2. At least one full spread spectrum polynomial should pass during the scan
*    time.
* 3. The value of the number of conversions should be an integer multiple of the
*    repeat period of the polynomial, that is specified by the
*    Sense Clock LFSR Polynomial parameter.
*
* \param autoSelMode
*  Defines set of rules, to be checked in order to decide if the SSC clock
*  source is applicable for the specified parameters.
*
* \param lfsrDitherCycles
*  Dintering variation in the number of Mod Clock cycles.
*
* \param ditherLimitCycles
*  Max dither in percentage, the actual clock dithering variation should
*  be limited with.
*
* \param lfsrPolySize
*  Number of Sense Clock cycles, required to fully pass the configured
*  polynomial.
*
* \param subConvNumber
*  Number of sub-conversions(including Dummy).
*
* \return
* Returns the valid clock source:
* - CY_CAPSENSE_CLK_SOURCE_SSC    -if SSC is valid for the specified widget
*                                  configuration.
* - CY_CAPSENSE_CLK_SOURCE_DIRECT -if SSC is not valid for the specified widget
*                                  configuration.
*
*******************************************************************************/
uint32_t Cy_CapSense_RunSSCAuto(
                uint32_t autoSelMode,
                uint32_t lfsrDitherCycles,
                uint32_t ditherLimitCycles,
                uint32_t lfsrPolySize,
                uint32_t subConvNumber)
{
    uint32_t snsClkSrc = CY_CAPSENSE_CLK_SOURCE_SSC;

    /* Check if the Sense Clock variation is lower than MAX allowed. */
    if(lfsrDitherCycles > ditherLimitCycles)
    {
        snsClkSrc = CY_CAPSENSE_CLK_SOURCE_DIRECT;
    }

    /*
    * Check if at least one whole polynomial period will be performed
    * during the scan. This part of code is executed if the Clock Source
    * auto selection mode is set to Medium or Strong.
    */
    if(autoSelMode != CY_CAPSENSE_SNS_CLK_SOURCE_AUTO_SEL_MODE_WEAK)
    {
        if(subConvNumber < lfsrPolySize)
        {
            snsClkSrc = CY_CAPSENSE_CLK_SOURCE_DIRECT;
        }
    }

    /*
    * Check if the integer number of the polynomial periods will be performed
    * during the scan. This part of code is executed if the Clock Source
    * auto selection mode is set to Strong.
    */
    if(autoSelMode == CY_CAPSENSE_SNS_CLK_SOURCE_AUTO_SEL_MODE_STRONG)
    {
        if(0u != (subConvNumber % lfsrPolySize))
        {
            snsClkSrc = CY_CAPSENSE_CLK_SOURCE_DIRECT;
        }
    }

    return (snsClkSrc);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetClkSrcPRSAuto
****************************************************************************//**
*
* Performs checking if the PRS clock source is valid for the widget, specified
* by the input parameter.
*
* \param ptrWdContext
*  Specifies the pointer to a widget context structure.
*
* \param context
*  The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
*  Returns the valid clock source:
* - PRS    -if SSC is valid for the specified widget configuration.
* - Direct -if SSC is not valid for the specified widget configuration.
* The CY_CAPSENSE_CLK_SOURCE_PRS_AUTO_MASK bit is always set in the return
* value.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetClkSrcPRSAuto(
                const cy_stc_capsense_widget_context_t * ptrWdContext,
                const cy_stc_capsense_context_t * context)
{
    uint32_t snsClkSrc;
    uint32_t lfsrPolySize;
    uint32_t risingEdgesNum;
    uint32_t subConvNumber;

    snsClkSrc = CY_CAPSENSE_CLK_SOURCE_PRS;

