RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    /*
    * Determine the whole number of sub-conversion per scan (includes Dummy and
    * Measurement conversions).
    */
    subConvNumber = ptrWdContext->numSubConversions;
    subConvNumber += context->ptrCommonContext->numFineInitCycles;

    /*
    * Determine the polynomial duration in clock cycles, e.g. the duration of 8-bit
    * polynomial is 255 clock cycles.
    */
    lfsrPolySize = Cy_CapSense_GetPolySize(context->ptrCommonContext->lfsrPoly);

    /*
    * The number of rising edges per one PRS period is (polyLength + 1) / 4.
    * polyLength = 2^N - 1, where N is size of the shift register (8BIT, 12BIT, etc).
    */
    risingEdgesNum = (lfsrPolySize + 1u) >> 2u;

    /*
    * Check if at least one whole polynomial period will be performed
    * during the scan.
    */
    if(subConvNumber < risingEdgesNum)
    {
        snsClkSrc = CY_CAPSENSE_CLK_SOURCE_DIRECT;
    }

    return (snsClkSrc | CY_CAPSENSE_CLK_SOURCE_PRS_AUTO_MASK);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetPolySize
****************************************************************************//**
*
* Calculates the number of Sense Clock cycles, required to fully pass the
* specified polynomial.
*
* \param lfsrPoly
*  Specifies the polynomial the calculation should be performed for.
*
* \return
*  Number of Sense Clock cycles, required to fully pass the specified
*  polynomial.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetPolySize(uint32_t lfsrPoly)
{
    /* Initialization the msbIndex variable with the MAX possible size of polynomial */
    uint32_t polySize = 0xFFFFu;
    uint32_t polyMsbMask = 0x8000u;

    while((1u < polySize) && (0u == (lfsrPoly & polyMsbMask)))
    {
        polySize >>= 1u;
        polyMsbMask >>= 1u;
    }

    return(polySize);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetLfsrBitsNumber
****************************************************************************//**
*
* Determines SNS_CTL.LFSR_BITS option, required to provide the max clock
* dithering variation for the specified parameters.
*
* \param snsClkDivider
* The divider value for the sense clock.
*
* \param snsClkDividerMin
* The minimal valid value of the sense clock divider.
*
* \param ditherLimitPercents
*  Max dither in percentage, the actual clock dither should be limited with.
*
* \param lfsrScale
*  Number of bits to shift the LFSR output left before adding to SENSE_DIV.
*
* \return
*  The SNS_CTL.LFSR_BITS option:
*   - CY_CAPSENSE_LFSR_BITS_RANGE_0 - Use 2 bits range: [-2,1]
*   - CY_CAPSENSE_LFSR_BITS_RANGE_1 - Use 3 bits range: [-4,3]
*   - CY_CAPSENSE_LFSR_BITS_RANGE_2 - Use 4 bits range: [-8,7]
*   - CY_CAPSENSE_LFSR_BITS_RANGE_3 - Use 5 bits range: [-16,15]
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLfsrBitsNumber(
                uint32_t snsClkDivider,
                uint32_t snsClkDividerMin,
                uint32_t ditherLimitPercents,
                uint32_t lfsrScale)
{
    uint32_t retVal;
    uint32_t ditherLimitCycles;

    /*
    * Determine the max allowed clock dithering variation for the specified
    * Sense Clock divider, LFSR dither (in percents) and LFSR scale values.
    */
    ditherLimitCycles = Cy_CapSense_GetLfsrDitherLimit(snsClkDivider, snsClkDividerMin,
                                                       ditherLimitPercents, lfsrScale);

    /* Based in the MAX allowed clock dithering, Determines the LFSR_BITS option. */
    if(CY_CAPSENSE_LFSR_RANGE_3_DITHER_MAX <= ditherLimitCycles)
    {
        retVal = CY_CAPSENSE_LFSR_BITS_RANGE_3;
    }
    else if(CY_CAPSENSE_LFSR_RANGE_2_DITHER_MAX <= ditherLimitCycles)
    {
        retVal = CY_CAPSENSE_LFSR_BITS_RANGE_2;
    }
    else if(CY_CAPSENSE_LFSR_RANGE_1_DITHER_MAX <= ditherLimitCycles)
    {
        retVal = CY_CAPSENSE_LFSR_BITS_RANGE_1;
    }
    else
    {
        retVal = CY_CAPSENSE_LFSR_BITS_RANGE_0;
    }

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetLfsrDitherVal
****************************************************************************//**
*
* Determines the clock dithering variation for the specified parameters.
*
* \param lfsrBits
*  The supported SNS_CTL.LFSR_BITS option:
*   - CY_CAPSENSE_LFSR_BITS_RANGE_0 - Use 2 bits range: [-2,1]
*   - CY_CAPSENSE_LFSR_BITS_RANGE_1 - Use 3 bits range: [-4,3]
*   - CY_CAPSENSE_LFSR_BITS_RANGE_2 - Use 4 bits range: [-8,7]
*   - CY_CAPSENSE_LFSR_BITS_RANGE_3 - Use 5 bits range: [-16,15]
*
* \param lfsrScale
*  Number of bits to shift the LFSR output left before adding to SENSE_DIV.
*
* \return
*  Dintering variation in the number of Mod Clock cycles.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLfsrDitherVal(
                uint32_t lfsrBits,
                uint32_t lfsrScale)
{
    return (uint32_t)(1uL << (((lfsrBits & CY_CAPSENSE_LFSR_BITS_RANGE_MASK) + 1u) + lfsrScale));
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetLfsrDitherLimit
****************************************************************************//**
*
* Determines the max allowed clock dithering variation for the specified
* parameters.
*
* \param snsClkDivider
* The divider value for the sense clock.
*
* \param snsClkDividerMin
* The minimal valid value of the sense clock divider.
*
* \param ditherLimitPercents
* Max dither in percentage, the actual clock dither should be limited with.
*
* \param lfsrScale
*  Number of bits to shift the LFSR output left before adding to SENSE_DIV.
*
* \return
*  Dintering variation in the number of Mod Clock cycles.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetLfsrDitherLimit(
                uint32_t snsClkDivider,
                uint32_t snsClkDividerMin,
                uint32_t ditherLimitPercents,
                uint32_t lfsrScale)
{
    uint32_t ditherLimitCycles;
    uint32_t ditherLimitCyclesMax;

