RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    /*
    * Determine the dither limit in clock cycles for the specified Dither limit
    * in percents.
    */
    ditherLimitCycles = ((ditherLimitPercents * snsClkDivider) / CY_CAPSENSE_PERCENTAGE_100);
    ditherLimitCycles >>= lfsrScale;

    /* Determine MAX allowed dither in cycles for the specified Sense Clock divider. */
    ditherLimitCyclesMax = (snsClkDivider - snsClkDividerMin) / (1u << lfsrScale);

    /*
    * Determine the minimal value to eliminate violation of allowed Sense Clock
    * divider range.
    */
    if(ditherLimitCycles > ditherLimitCyclesMax)
    {
        ditherLimitCycles = ditherLimitCyclesMax;
    }

    return (ditherLimitCycles);
}


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_FULL_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_HW_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_SsAutoTune
****************************************************************************//**
*
* Performs the parameters auto-tuning for the optimal CAPSENSE&trade; operation when
* smart sensing algorithm is enabled.
*
* This function performs the following tasks:
* - Tune the Sense Clock optimal value.
* - Calculate the number of sub-conversions for the optimal finger capacitance.
* - Calibrate Reference and Compensation CDACs.
*
* \note
* The function supposes final auto-calibration is called right after this
* function.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - Zero     - All the widgets are auto-tuned successfully.
* - Non-zero - Auto-tuning failed for any widget.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SsAutoTune(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t autoTuneStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t i;
    uint32_t j;
    uint32_t range;
    MSC_Type * mscBase;
    uint32_t curChIndex;
    uint32_t rawCountMax;
    cy_stc_capsense_hw_smartsense_config_t autoTuneConfig;
    const cy_stc_capsense_widget_config_t * ptrWdCfg;
    cy_stc_capsense_widget_context_t * ptrWdCxt;
    cy_stc_capsense_sensor_context_t * ptrSnsCxt;
    const cy_stc_capsense_common_config_t * ptrCommonCfg = context->ptrCommonConfig;
    cy_stc_capsense_common_context_t * ptrCommonCxt = context->ptrCommonContext;
    #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
        uint32_t loopFlag;
        uint64_t wdIdMask;
        uint32_t maxDivider;
        uint32_t maxSubconversions;
        uint32_t wdIndex[CY_CAPSENSE_MAX_CH_NUM];
    #endif /* (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u) */

    ptrCommonCxt->status |= CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK;

    /* Step #0: Check if configuration is valid */
    if ((ptrCommonCfg->counterMode != CY_CAPSENSE_COUNTER_MODE_SATURATE) ||
        ((ptrCommonCfg->csdCdacCompDivAutoEn != CY_CAPSENSE_ENABLE) && (ptrCommonCfg->csdCdacCompEn == CY_CAPSENSE_ENABLE)) ||
        (ptrCommonCfg->csdRefCdacAutoEn != CY_CAPSENSE_ENABLE) ||
        (ptrCommonCfg->numWd > CY_CAPSENSE_SMARTSENSE_WD_MAX_NUMBER))
    {
        autoTuneStatus |= CY_CAPSENSE_STATUS_BAD_CONFIG;
    }

    /* Step #1: Sets the default parameters for the preliminary scanning */
    ptrWdCfg = context->ptrWdConfig;
    for (i = 0u; i < ptrCommonCfg->numWd; i++)
    {
        /*
        * Set the Sense Clock source set to Direct.
        * Since the Number of Epilogue cycles is a common parameter, it is required
        * to configure the Sense Clock source to Direct for all widgets (including CSX)
        * in order to have correct number of Epilogue cycles for operation with
        * the Direct clock.The setup of the Epilogue cycles number is the part of
        * the Cy_CapSense_InitializeSourceSenseClk() routine.
        */
        ptrWdCxt = ptrWdCfg->ptrWdContext;
        ptrWdCxt->snsClkSource <<= CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS;

        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            ptrWdCxt->numSubConversions = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_NSUB;
            ptrWdCxt->cdacRef = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_REF_CDAC;
            ptrWdCxt->rowCdacRef = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_REF_CDAC;
            ptrWdCxt->snsClk = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK;
            ptrWdCxt->rowSnsClk = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK;
            ptrSnsCxt = ptrWdCfg->ptrSnsContext;
            for (j = 0u; j < ptrWdCfg->numSns; j++)
            {
                ptrSnsCxt->cdacComp = 0u;
                ptrSnsCxt++;
            }
        }
        ptrWdCfg++;
    }
    autoTuneStatus |= Cy_CapSense_SsInitialize(context);

    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        mscBase = ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase;

        mscBase->SCAN_CTL2 &= (uint32_t)~((uint32_t)MSC_SCAN_CTL2_NUM_EPI_CYCLES_Msk);
        mscBase->SCAN_CTL2 |= (uint32_t)((uint32_t)CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK <<
                                                   MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos);

        mscBase->INIT_CTL4 &= (uint32_t)~((uint32_t)MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Msk);
        mscBase->INIT_CTL4 |= (uint32_t)((uint32_t)CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK <<
                                                   MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Pos);
    }

    /* Step #2: Execute preliminary scan */
    autoTuneStatus |= Cy_CapSense_ScanAllSlots(context);
    while (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(context)) {}

    /* Step #3: Update settings for the widgets / sensors with low capacitance */
    ptrWdCfg = context->ptrWdConfig;
    for (i = 0u; i < ptrCommonCfg->numWd; i++)
    {
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            ptrWdCxt = ptrWdCfg->ptrWdContext;
            range = 0u;
            rawCountMax = ((uint32_t)ptrCommonCfg->csdRawTarget * context->ptrWdContext[i].maxRawCount) /
                    CY_CAPSENSE_PERCENTAGE_100;
            for (j = 0u; j < ptrWdCfg->numSns; j++)
            {
                if (rawCountMax < ptrWdCfg->ptrSnsContext[j].raw)
                {
                    /* Next Widget */
                    range = 1u;
                    break;
                }
            }
            /* Lower capacitance range */
            if (range == 0u)
            {
                ptrWdCxt->numSubConversions = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_NSUB_RANGE2;
                ptrWdCxt->snsClk = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK_RANGE2;
                ptrWdCxt->rowSnsClk = CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK_RANGE2;
            }
        }
        ptrWdCfg++;
    }
    autoTuneStatus |= Cy_CapSense_SsInitialize(context);

    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
    {
        mscBase = ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase;

