RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v3.c
    autoTuneStatus |= Cy_CapSense_SsInitialize(context);

    ptrCommonCxt->status &= ~CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK;

    return autoTuneStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsAutoTuneScanDurationAlignment
****************************************************************************//**
*
* Updates specified widgets with provided SnsClk/TxClk and Nsub.
*
* \param widgetMask
* A mask of widgets. The first bit correspond to a widget with ID = 0. The
* second bit corresponds to widget with ID = 1. And so on.
*
* \param clockDivider
* Specifies a divider should be configured.
*
* \param subConversion
* Specifies a number of sub-conversions should be configured.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SsAutoTuneScanDurationAlignment(
                uint64_t widgetMask,
                uint32_t clockDivider,
                uint32_t subConversion,
                cy_stc_capsense_context_t * context)
{
    cy_stc_capsense_widget_context_t * ptrWdCxt = context->ptrWdContext;
    uint64_t widgetMaskLocal = widgetMask;

    while (widgetMaskLocal != 0u)
    {
        if (0u != (widgetMaskLocal & 0x01u))
        {
            ptrWdCxt->snsClk = (uint16_t)clockDivider;
            ptrWdCxt->rowSnsClk = (uint16_t)clockDivider;
            ptrWdCxt->numSubConversions = (uint16_t)subConversion;
        }
        widgetMaskLocal >>= 1u;
        ptrWdCxt++;
    }
}
#endif


/*******************************************************************************
* Function Name: Cy_CapSense_GetMaxRaw
****************************************************************************//**
*
* Returns the theoretical MAX raw count for desired frequency channel.
*
* \param snsClk
* The divider value for the sense clock.
*
* \param ptrWdConfig
* Specifies the pointer to a widget configuration structure.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Theoretical MAX raw count.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetMaxRaw(
                uint32_t snsClk,
                const cy_stc_capsense_widget_config_t * ptrWdConfig,
                const cy_stc_capsense_context_t * context)
{
    uint32_t maxRawTmp;

    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        uint32_t snsClkTmp;
    #endif

    #if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_CIC2_FILTER_EN)
        snsClkTmp = snsClk;
        if(CY_CAPSENSE_CLK_SOURCE_PRS == (ptrWdConfig->ptrWdContext->snsClkSource & CY_CAPSENSE_CLK_SOURCE_MASK))
        {
            snsClkTmp <<= CY_CAPSENSE_PRS_SNS_KREF_SHIFT;
        }

        maxRawTmp = (((uint32_t)context->ptrInternalContext->numEpiCycles * ptrWdConfig->numChopCycles) - 1u) +
                (((uint32_t)ptrWdConfig->ptrWdContext->numSubConversions * ptrWdConfig->numChopCycles) * snsClkTmp);
    #else
        maxRawTmp = (uint32_t)ptrWdConfig->ptrWdContext->cicRate * ptrWdConfig->ptrWdContext->cicRate;
        (void)snsClk;
        (void)context;
    #endif
    maxRawTmp = (maxRawTmp > MSC_STATUS1_RAW_COUNT_Msk) ?
                 ((uint16_t)MSC_STATUS1_RAW_COUNT_Msk) : maxRawTmp;

    return maxRawTmp;
}


#endif /* CY_IP_M0S8MSCV3 */


/* [] END OF FILE */
